V1/Data/linkerd-2/240-3-wrk2-dj8g7.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 26.121ms, rate sampling interval: 121ms
  Thread calibration: mean lat.: 24.950ms, rate sampling interval: 115ms
  Thread calibration: mean lat.: 24.410ms, rate sampling interval: 126ms
  Thread calibration: mean lat.: 24.799ms, rate sampling interval: 111ms
  Thread calibration: mean lat.: 23.323ms, rate sampling interval: 86ms
  Thread calibration: mean lat.: 24.513ms, rate sampling interval: 121ms
  Thread calibration: mean lat.: 22.039ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 24.765ms, rate sampling interval: 59ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.38ms   23.42ms   1.06s    95.36%
    Req/Sec    10.00     49.34   510.00     94.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.98ms
 75.000%   23.02ms
 90.000%   30.09ms
 99.000%  102.97ms
 99.900%  388.61ms
 99.990%  421.12ms
 99.999%    1.06s 
100.000%    1.06s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.843     0.000000            1         1.00
      10.775     0.100000         2313         1.11
      11.735     0.200000         4616         1.25
      12.783     0.300000         6932         1.43
      14.383     0.400000         9236         1.67
      16.975     0.500000        11542         2.00
      18.319     0.550000        12688         2.22
      19.647     0.600000        13854         2.50
      20.767     0.650000        14995         2.86
      21.823     0.700000        16149         3.33
      23.023     0.750000        17315         4.00
      23.807     0.775000        17883         4.44
      24.783     0.800000        18466         5.00
      25.791     0.825000        19034         5.71
      27.087     0.850000        19608         6.67
      28.479     0.875000        20189         8.00
      29.215     0.887500        20477         8.89
      30.095     0.900000        20765        10.00
      31.071     0.912500        21051        11.43
      32.495     0.925000        21340        13.33
      34.271     0.937500        21627        16.00
      35.903     0.943750        21776        17.78
      39.999     0.950000        21915        20.00
      47.775     0.956250        22059        22.86
      53.215     0.962500        22203        26.67
      64.447     0.968750        22349        32.00
      70.847     0.971875        22421        35.56
      76.607     0.975000        22492        40.00
      82.047     0.978125        22564        45.71
      88.575     0.981250        22636        53.33
      92.799     0.984375        22709        64.00
      95.807     0.985938        22744        71.11
      99.903     0.987500        22780        80.00
     101.503     0.989062        22817        91.43
     104.959     0.990625        22853       106.67
     114.623     0.992188        22888       128.00
     119.615     0.992969        22906       142.22
     122.175     0.993750        22924       160.00
     123.967     0.994531        22943       182.86
     129.855     0.995313        22960       213.33
     137.855     0.996094        22979       256.00
     139.263     0.996484        22987       284.44
     140.927     0.996875        22997       320.00
     141.567     0.997266        23005       365.71
     142.719     0.997656        23014       426.67
     147.199     0.998047        23023       512.00
     361.983     0.998242        23028       568.89
     365.311     0.998437        23032       640.00
     375.295     0.998633        23037       731.43
     385.791     0.998828        23041       853.33
     389.119     0.999023        23046      1024.00
     390.911     0.999121        23049      1137.78
     393.727     0.999219        23050      1280.00
     397.311     0.999316        23053      1462.86
     404.991     0.999414        23055      1706.67
     409.343     0.999512        23057      2048.00
     411.391     0.999561        23058      2275.56
     411.647     0.999609        23060      2560.00
     411.903     0.999658        23061      2925.71
     412.159     0.999707        23062      3413.33
     416.511     0.999756        23063      4096.00
     416.511     0.999780        23063      4551.11
     417.791     0.999805        23064      5120.00
     419.327     0.999829        23065      5851.43
     419.327     0.999854        23065      6826.67
     421.119     0.999878        23066      8192.00
     421.119     0.999890        23066      9102.22
     421.119     0.999902        23066     10240.00
     424.447     0.999915        23067     11702.86
     424.447     0.999927        23067     13653.33
     424.447     0.999939        23067     16384.00
     424.447     0.999945        23067     18204.44
     424.447     0.999951        23067     20480.00
    1060.863     0.999957        23068     23405.71
    1060.863     1.000000        23068          inf
#[Mean    =       21.376, StdDeviation   =       23.420]
#[Max     =     1059.840, Total count    =        23068]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24006 requests in 5.00m, 8.86MB read
  Socket errors: connect 0, read 0, write 0, timeout 6000
Requests/sec:     79.98
Transfer/sec:     30.23KB