V1/Data/linkerd-2/240-4-wrk2-bzpds.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 21.499ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 22.970ms, rate sampling interval: 64ms
  Thread calibration: mean lat.: 22.825ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 22.839ms, rate sampling interval: 81ms
  Thread calibration: mean lat.: 22.239ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 22.349ms, rate sampling interval: 76ms
  Thread calibration: mean lat.: 25.150ms, rate sampling interval: 90ms
  Thread calibration: mean lat.: 21.133ms, rate sampling interval: 71ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.52ms   17.06ms 148.10ms   91.82%
    Req/Sec     9.97     38.59   328.00     93.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.77ms
 75.000%   22.78ms
 90.000%   32.62ms
 99.000%   96.45ms
 99.900%  134.91ms
 99.990%  146.56ms
 99.999%  148.22ms
100.000%  148.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.187     0.000000            1         1.00
      11.471     0.100000         2305         1.11
      12.415     0.200000         4631         1.25
      13.295     0.300000         6927         1.43
      14.351     0.400000         9212         1.67
      15.775     0.500000        11522         2.00
      16.719     0.550000        12675         2.22
      17.983     0.600000        13826         2.50
      19.455     0.650000        14975         2.86
      21.055     0.700000        16131         3.33
      22.783     0.750000        17276         4.00
      23.599     0.775000        17850         4.44
      24.543     0.800000        18427         5.00
      25.695     0.825000        19010         5.71
      27.279     0.850000        19576         6.67
      29.455     0.875000        20152         8.00
      30.911     0.887500        20440         8.89
      32.623     0.900000        20727        10.00
      35.775     0.912500        21017        11.43
      42.975     0.925000        21303        13.33
      50.943     0.937500        21591        16.00
      54.751     0.943750        21739        17.78
      59.263     0.950000        21880        20.00
      64.703     0.956250        22023        22.86
      70.463     0.962500        22167        26.67
      76.287     0.968750        22311        32.00
      79.807     0.971875        22383        35.56
      82.623     0.975000        22456        40.00
      85.247     0.978125        22527        45.71
      87.487     0.981250        22600        53.33
      89.855     0.984375        22671        64.00
      91.519     0.985938        22708        71.11
      93.183     0.987500        22744        80.00
      95.423     0.989062        22779        91.43
      97.343     0.990625        22815       106.67
     100.543     0.992188        22851       128.00
     103.167     0.992969        22869       142.22
     105.343     0.993750        22887       160.00
     108.159     0.994531        22905       182.86
     111.871     0.995313        22923       213.33
     118.207     0.996094        22942       256.00
     120.831     0.996484        22950       284.44
     122.751     0.996875        22959       320.00
     124.607     0.997266        22968       365.71
     126.591     0.997656        22977       426.67
     129.023     0.998047        22986       512.00
     129.535     0.998242        22991       568.89
     130.815     0.998437        22995       640.00
     131.711     0.998633        22999       731.43
     133.631     0.998828        23005       853.33
     135.039     0.999023        23008      1024.00
     136.959     0.999121        23011      1137.78
     137.471     0.999219        23013      1280.00
     137.855     0.999316        23015      1462.86
     138.367     0.999414        23018      1706.67
     138.495     0.999512        23020      2048.00
     138.495     0.999561        23020      2275.56
     140.031     0.999609        23022      2560.00
     140.543     0.999658        23023      2925.71
     141.055     0.999707        23024      3413.33
     142.463     0.999756        23025      4096.00
     142.463     0.999780        23025      4551.11
     143.743     0.999805        23026      5120.00
     145.919     0.999829        23027      5851.43
     145.919     0.999854        23027      6826.67
     146.559     0.999878        23028      8192.00
     146.559     0.999890        23028      9102.22
     146.559     0.999902        23028     10240.00
     147.839     0.999915        23029     11702.86
     147.839     0.999927        23029     13653.33
     147.839     0.999939        23029     16384.00
     147.839     0.999945        23029     18204.44
     147.839     0.999951        23029     20480.00
     148.223     0.999957        23030     23405.71
     148.223     1.000000        23030          inf
#[Mean    =       21.519, StdDeviation   =       17.063]
#[Max     =      148.096, Total count    =        23030]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24008 requests in 5.00m, 8.86MB read
  Socket errors: connect 0, read 0, write 0, timeout 6000
Requests/sec:     80.02
Transfer/sec:     30.24KB