V1/Data/linkerd-2/60-3-wrk2-p9jrf.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 18.484ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 18.835ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 17.750ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 18.432ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 19.518ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 19.382ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 15.957ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 17.556ms, rate sampling interval: 50ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.84ms   18.43ms 139.26ms   91.31%
    Req/Sec     2.46     25.68   781.00     98.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.72ms
 75.000%   22.29ms
 90.000%   33.60ms
 99.000%  100.86ms
 99.900%  131.07ms
 99.990%  138.49ms
 99.999%  139.39ms
100.000%  139.39ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.987     0.000000            1         1.00
      11.183     0.100000          569         1.11
      12.191     0.200000         1132         1.25
      13.271     0.300000         1700         1.43
      14.367     0.400000         2265         1.67
      15.719     0.500000         2829         2.00
      16.463     0.550000         3114         2.22
      17.487     0.600000         3392         2.50
      18.911     0.650000         3675         2.86
      20.703     0.700000         3958         3.33
      22.287     0.750000         4240         4.00
      23.055     0.775000         4384         4.44
      23.935     0.800000         4523         5.00
      25.023     0.825000         4667         5.71
      26.703     0.850000         4806         6.67
      29.407     0.875000         4947         8.00
      31.407     0.887500         5019         8.89
      33.599     0.900000         5088        10.00
      39.775     0.912500         5159        11.43
      48.639     0.925000         5230        13.33
      57.279     0.937500         5300        16.00
      62.239     0.943750         5336        17.78
      68.543     0.950000         5371        20.00
      73.599     0.956250         5406        22.86
      78.463     0.962500         5442        26.67
      83.199     0.968750         5477        32.00
      86.463     0.971875         5495        35.56
      89.151     0.975000         5512        40.00
      91.391     0.978125         5531        45.71
      93.503     0.981250         5548        53.33
      95.935     0.984375         5565        64.00
      97.087     0.985938         5575        71.11
      98.943     0.987500         5583        80.00
     100.287     0.989062         5592        91.43
     102.399     0.990625         5602       106.67
     104.383     0.992188         5609       128.00
     105.983     0.992969         5614       142.22
     107.199     0.993750         5618       160.00
     111.423     0.994531         5623       182.86
     112.575     0.995313         5627       213.33
     114.687     0.996094         5632       256.00
     115.711     0.996484         5634       284.44
     117.887     0.996875         5636       320.00
     119.551     0.997266         5638       365.71
     121.599     0.997656         5640       426.67
     121.791     0.998047         5642       512.00
     126.143     0.998242         5644       568.89
     127.167     0.998437         5645       640.00
     130.751     0.998633         5646       731.43
     131.071     0.998828         5647       853.33
     134.655     0.999023         5648      1024.00
     136.063     0.999121         5649      1137.78
     136.063     0.999219         5649      1280.00
     137.215     0.999316         5650      1462.86
     137.215     0.999414         5650      1706.67
     137.343     0.999512         5651      2048.00
     137.343     0.999561         5651      2275.56
     137.343     0.999609         5651      2560.00
     138.495     0.999658         5652      2925.71
     138.495     0.999707         5652      3413.33
     138.495     0.999756         5652      4096.00
     138.495     0.999780         5652      4551.11
     138.495     0.999805         5652      5120.00
     139.391     0.999829         5653      5851.43
     139.391     1.000000         5653          inf
#[Mean    =       21.835, StdDeviation   =       18.426]
#[Max     =      139.264, Total count    =         5653]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6007 requests in 5.00m, 2.22MB read
  Socket errors: connect 0, read 0, write 0, timeout 24000
Requests/sec:     20.01
Transfer/sec:      7.56KB